# IsCurtainPanelFamily Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Family..::..IsCurtainPanelFamily Property
Family Class See Also
---
Whether the Family is a Curtain Panel family. Curtain Panel family symbols are used as the ObjectTypes of DividedSurface elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsCurtainPanelFamily { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsCurtainPanelFamily As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsCurtainPanelFamily {
	bool get ();
}
```

# See Also
Family Class
Autodesk.Revit.DB Namespace